{
  "name": "DON BASIL PETER",
  "title": "Software Engineer",
  "intro": "Talented Software Developer equipped with great coding and debugging abilities. Accomplishes project goals with elegant, scalable code. Works great with team members under Agile and Scrum frameworks.",
  "phone": "+1 226-886-5315",
  "mail": "donbasilpeter@gmail.com",
  "tools": ["JavaScript","TypeScript","React","NestJS","Node.js","Angular","Python","Flask","FastAPI","PostgreSQL","MongoDB","GraphQL","Docker","Git","Jest","LangChain","OpenAI","LLM","HTML","CSS","Redux.js","SwaggerAPI","Prompt Engineering"],
  "education": [
    {
      "institution": "Lambton College",
      "location": "Sarnia, ON",
      "course": "Full Stack Software Development",
      "start_date": "September 2023",
      "end_date": "Present"
    },
    {
      "institution": "St. Joseph's College of Engineering",
      "location": "Palai, Kerala",
      "course": "B.Tech, computer science & Engineering",
      "start_date": "July 2017",
      "end_date": "July 2021"
    }
  ],
  "skills": [
    "Experienced full stack developer with a strong track record of formulating, developing, and maintaining web applications.","Built RESTful APIs and combined third-party services to improve application functionality.","Analyzed and tested applications prior to launch to remedy last minute issues.","Delivered code to meet functional or technical specifications.","Experience with Agile development methodologies."
  ],
  "projects": [
    {
      "name": "CaseFlow",
      "start_date": "June 2022",
      "end_date": "July 2023",
      "location": "Trivandrum, Kerala",
      "position": "Software Engineer",
      "skills": [
        "Spearheaded design and development of CaseFlow, an open-source generic Case Management application, showcasing expertise in full-stack development.","Applied a modern tech stack including NestJS for backend, React for frontend, PostgreSQL for database management, and Flask for custom API development.","Integrated CaseFlow with Formsflow.ai, leveraging existing technologies to build up functionality and efficiency.","Implemented robust and scalable backend architecture with NestJS, ensuring optimal performance and maintainability.","Utilized GraphQL for efficient query execution and raised application flexibility.","Seamlessly consolidated the APIs with external services: S3, SharePoint, and Alfresco for file management.","Facilitated clear and effective communication within team and with clients, ensuring a collaborative and transparent development process."
      ]
    },
        {
      "name": "Stock Market Portfolio Tool",
      "start_date": "February 2021",
      "end_date": "May 2021",
      "location": "Pala, Kerala",
      "position": "Developer",
      "desc": "",
      "skills": [
        "Devised a comprehensive web application to analyze historical performance of stock portfolios deploying the MERN (MongoDB, Express.js, React.js, Node.js) stack.","Accomplished a user-friendly interface with Fixma for a boosted user experience, ensuring smooth navigation and interaction.","Leveraged GraphQL for efficient data retrieval and manipulation, increasing application responsiveness and performance.","Designed an algorithm to assess risk and reward of various stock combinations, ultimately suggesting optimal portfolio for maximum returns.","Employed MongoDB for robust data storage and retrieval, ensuring scalability and efficient handling of large datasets.","Handled a responsive and dynamic front-end by React.js allowing users to visualize and interpret portfolio performance trends."
      ]
    },
        {
      "name": "Formsflow.ai",
      "start_date": "April 2022",
      "end_date": "May 2022",
      "location": "Trivandrum, Kerala",
      "position": "Software Engineer",
      "skills": [
        "Developed and tested Forms-flow web application using React Testing.","Played a pivotal role in development of a scalable and high-performance backend using Node.js, focusing on RESTful API design and optimization.","Utilized MongoDB for flexible and efficient database management, including schema design and query optimization.","Demonstrated a proactive approach to troubleshooting and debugging, ensuring stability and reliability ofboth frontend and backend components."
      ]
    },
        {
      "name": "MODUURN",
      "start_date": "October 2021",
      "end_date": "March 2022",
      "location": "Trivandrum, Kerala",
      "position": "Software Engineer",
      "skills": [
        "Created and maintained frontend components for Moduurn mobile ordering platform leveraging modern web technologies such as HTML, CSS, and JavaScript frameworks (Angular).","Collaborated with UI/UX designers to create intuitive and visually appealing user interfaces.","Remains up to date with emerging technologies and industry trends and proposes innovative solutions to enhance platform."
      ]
    }
  ],
  "experience": [
    {
      "name": "AOT Technologies",
      "start_date": "October 2021",
      "end_date": "July 2023",
      "location": "Trivandrum, Kerala",
      "position": "Software Engineer",
      "skills": [
        "Accomplished full-stack developer with a focus on delivering seamless user experiences.","Contributed expertise to high-impact projects, including Hootsuite, Caseflow, Formsflow, and Modurrn.","Proficient in MERN and MEAN stacks, showcasing versatility in full-stack development.","Collaborated with DevOps teams, ensuring streamlined development and deployment processes.","Mentored a junior developer, providing guidance and support throughout professional development journey, fostering a collaborative and knowledge-sharing environment within team."
      ]
    }
  ],
  "reference": "Don C Varghese, Sr. Software Engineer, AOT Technologies, Victoria, British Columbia"
}